// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
//     1. перебрати його циклом while
//     2. перебрати його циклом for
//     3. перебрати циклом while та вивести  числа тільки з непарним індексом
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// 7. замінити кожне число кратне 3 на слово "okten"
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// 10
// створити пустий масив та :
//     - заповнити його 50 парними числами за допомоги циклу.
// - заповнити його 50 непарними числами за допомоги циклу


// let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
//
// let i = 0;
//
// while (i < arr.length) {
//     if (i % 2 !== 0) {
//         console.log(arr[i]);
//     }
//     i++;
// }
//
// console.log('-____________________-');
//
//
// const length = arr.length;
//
// for (let j = 0; j < length; j++) {
//     const el = arr[j];
//
//     if (j % 2 !== 0) {
//         console.log(el);
//     }
// }
//
//
// i = 0;
// console.log('__________');
//
//
// while (i < arr.length) {
//     if (arr[i] % 2 === 0) {
//         console.log(arr[i]);
//     }
//     i++
// }
//
//
// for (let i = 0; i < arr.length; i++) {
//     if (arr[i] % 3 === 0) {
//         arr[i] = 'okten'
//     }
// }
//
// console.log(arr);
//
//
// console.log('__________');
//
//

let arr2 = [];

console.time('qwe');

while (arr2.length < 50) {
    let randomNumber = Math.floor(Math.random() * 999);
    console.log(randomNumber);

    if (randomNumber % 2 === 0) {
        arr2.push(3)
    }
}

console.timeEnd('qwe');

// console.log(arr2);
// console.log(arr2.length);



